## 2021.08.22(일)

# 파면 팔수록 쉽고 재미있는 머신러닝

# 2강 4. 파이썬 Pandas 주요 함수 및 기능 정리

---

In [7]:
#pandas를 import할 때 일반적으로 pd를 사용
import pandas as pd
import numpy as np

# Series
인덱스를 가지는 1차원 배열

In [34]:
#인덱스를 가진 0이상 1이하를 균일한 간격의 5개의 수로 1차원 배별 생성
data=pd.Series(np.linspace(0,1,num=5))
data

0    0.00
1    0.25
2    0.50
3    0.75
4    1.00
dtype: float64

In [35]:
#data를 배열로 보이기
data.values

array([0.  , 0.25, 0.5 , 0.75, 1.  ])

In [36]:
#data의 valuses type확인
type(data.values)

numpy.ndarray

In [37]:
#data의 index확인
data.index

RangeIndex(start=0, stop=5, step=1)

In [38]:
# data의 인덱스를 list로 변환
list(data.keys())

[0, 1, 2, 3, 4]

In [39]:
#data의 값들을 list로 변환
list(data.items())

[(0, 0.0), (1, 0.25), (2, 0.5), (3, 0.75), (4, 1.0)]

In [40]:
# data의 인덱스를 문자로 설정
data.index = ["a", "b", "c", "d", "e"]
data

a    0.00
b    0.25
c    0.50
d    0.75
e    1.00
dtype: float64

In [41]:
data.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

# Series에서도 numpy기반의 인덱싱, 슬라이싱. 마스킹. 팬시 인덱싱 사용 가능

In [15]:
#인덱싱
data[1]

0.25

In [16]:
#슬라이싱
data[2:4]

c    0.50
d    0.75
dtype: float64

In [17]:
# 마스킹
data[(data > 0.1) & (data < 0.6)]

b    0.25
c    0.50
dtype: float64

In [20]:
# 팬시 인덱싱
data[[2, 4]]

c    0.5
e    1.0
dtype: float64

# loc 인덱서와 iloc인덱서

### loc 인덱서 : 명시적 인덱스에 대해 사용

In [49]:
#a인덱스 값
data.loc["a"]

0.0

In [50]:
#a~c인덱스 값
#loc 슬라이싱은 입력값 범위 그대로 반영
data.loc["a":"c"]

a    0.00
b    0.25
c    0.50
dtype: float64

In [51]:
#a인덱스와 c인덱스 값
data.loc[["a", "c"]]

a    0.0
c    0.5
dtype: float64

In [48]:
# 0.7이상인 값들
data.loc[data > 0.7]

d    0.75
e    1.00
dtype: float64

### iloc 인덱서 : 암묵적 인덱스에 대해 사용

In [53]:
#첫번째 인덱스 값
#0=="a"
data.iloc[0]

0.0

In [55]:
#첫번째~두번째 인덱스 값
#iloc 슬라이싱은 end 인덱스는 미포함.
#0~2 == "a"~"c"
data.iloc[0:3]

a    0.00
b    0.25
c    0.50
dtype: float64

In [56]:
#첫번째와 세번째 인덱스 값
data.iloc[[0, 2]]

a    0.0
c    0.5
dtype: float64

# DataFrame
행 인덱스와 열 이름으로 구성 (다양한 타입의 데이터를 사용 가능)

In [121]:
#0이상, 10미만에서 난수로 3X4배열 생성
#열의 이름을 지정
np.random.seed(0)
df = pd.DataFrame(np.random.randint(10, size=(3, 4)), columns=['col1', 'col2', 'col3', 'col4'])
df

   col1  col2  col3  col4
0     5     0     3     3
1     7     9     3     5
2     2     4     7     6

In [122]:
#df의 값 타입
type(df.values)

numpy.ndarray

In [123]:
#df의 col2 인덱스 값
df["col2"], df.col2

(0    0
 1    9
 2    4
 Name: col2, dtype: int64,
 0    0
 1    9
 2    4
 Name: col2, dtype: int64)

In [124]:
#행을 하나만 지정할 때는 Series 깩체 반환
#0행 "col2"~"col4"열 값
df.loc[0, "col2":"col4"]

col2    0
col3    3
col4    3
Name: 0, dtype: int64

In [125]:
#행을 2개 이상 지정할 수 있는 형식을 사용할 때는 DataFrame 객체 반환
# 0~0까지의 행, "col2"~"col3"열 값
df.loc[0:0, "col2":"col3"]

   col2  col3
0     0     3

In [126]:
#행을 2개 이상 지정할 수 있는 형식을 사용할 때는 DataFrame 객체 반환
# 0행, "col2"~"col3"열 값
df.loc[[0], "col2":"col3"]

   col2  col3
0     0     3

In [127]:
#행을 2개 이상 지정할 수 있는 형식을 사용할 때는 DataFrame 객체 반환
# 0~2행, "col2"~"col3"열 값
df.loc[0:2, "col2":"col3"]

   col2  col3
0     0     3
1     9     3
2     4     7

In [128]:
# "col2"열에서 2보다 큰 값과 "col3"열에서 5보다 작은 값을 갖는 행들의 "col2"~"col3"열
df.loc[(df["col2"] > 2) & (df["col3"] < 5), "col2":"col3"]

   col2  col3
1     9     3

In [129]:
# 0행의 1~2열 == 0행의 "col2"~"col3"열
df.iloc[0, 1:3]

col2    0
col3    3
Name: 0, dtype: int64

In [130]:
# 0~0행의 1~2열 == 0~0행의 "col2"~"col3"열
df.iloc[0:1, 1:3]

   col2  col3
0     0     3

In [131]:
#0행의 1~2열 == 0행의 "col2"~"col3"
df.iloc[[0], 1:3]

   col2  col3
0     0     3

In [132]:
# 0~2행의 1~2열 == 0~2행의 "col2"~"col3"열
df.iloc[0:3, 1:3]

   col2  col3
0     0     3
1     9     3
2     4     7

# DataFrame 새로운 열 추가

In [133]:
df

   col1  col2  col3  col4
0     5     0     3     3
1     7     9     3     5
2     2     4     7     6

In [134]:
#df에 total이라는 열 추가
#total열의 값은 df의 열들의 합
df["total"] = df.sum(axis=1)
df

   col1  col2  col3  col4  total
0     5     0     3     3     11
1     7     9     3     5     24
2     2     4     7     6     19

# DataFrame 행과 열 제거

In [135]:
df

   col1  col2  col3  col4  total
0     5     0     3     3     11
1     7     9     3     5     24
2     2     4     7     6     19

In [136]:
#"col4"와 "total"의 열 제거
df = df.drop(["col4", "total"], axis=1)
df

   col1  col2  col3
0     5     0     3
1     7     9     3
2     2     4     7

In [137]:
#1행 제거
df.drop(index=1, axis=0)

   col1  col2  col3
0     5     0     3
2     2     4     7

# DataFrame객체의 널 값 연산
np.nan :NULL값
(nan : not a number)

In [139]:
# df 배열 생성
df = pd.DataFrame([[1, 2, 3],
                   [4, 5, 6],
                   [np.nan, 8, 9],
                   [10, np.nan, 12]])
df

      0    1   2
0   1.0  2.0   3
1   4.0  5.0   6
2   NaN  8.0   9
3  10.0  NaN  12

In [140]:
#널값이 있는 행 제거
df.dropna(axis=0)

     0    1  2
0  1.0  2.0  3
1  4.0  5.0  6

In [141]:
#df 행의 평균값으로 널값인 행 채우기
df.fillna(df.mean(axis=0))

      0    1   2
0   1.0  2.0   3
1   4.0  5.0   6
2   5.0  8.0   9
3  10.0  5.0  12

# DataFrame 객체의 조인
pd.merge() :두 Dataframe을 동일한 값을 가진 열값(left on, right on)을 기준으로 연결

drop() : 겹치는 데이터를 제거해주기 위함.

how="outer" : 한쪽의 값의 누락으로 join이 안된 행을 누락시키지 않도록 해줌.

In [144]:
df1 = pd.DataFrame({'name': ['이순신', '강감찬', '을지문덕', '김유신'],
                    'dept': ['연구개발', '영업', '연구개발', '인사']})
df1

   name  dept
0   이순신  연구개발
1   강감찬    영업
2  을지문덕  연구개발
3   김유신    인사

In [150]:
df2 = pd.DataFrame({'emp_name': ['강감찬', '을지문덕', '이순신', '이순신'],
                    'project': ["S", "D", "A", "S"]})
df2

  emp_name project
0      강감찬       S
1     을지문덕       D
2      이순신       A
3      이순신       S

In [154]:
#df1의 name과 df2의 emp_nmae이 동일한 값이므로 merge 사용 가능
#동일 데이터 중, df1를 윈쪽, df2를 오른쪽으로 위치해서 병합
pd.merge(df1, df2, left_on="name", right_on="emp_name")

   name  dept emp_name project
0   이순신  연구개발      이순신       A
1   이순신  연구개발      이순신       S
2   강감찬    영업      강감찬       S
3  을지문덕  연구개발     을지문덕       D

In [155]:
#df1의 name과 df2의 emp_nmae이 동일한 값이므로 merge 사용 가능
#동일 데이터 중, df1를 윈쪽, df2를 오른쪽으로 위치해서 병합
#데이터가 겹치니 둘 중 하나를 체거 (여기선 df2의 emp_name열을 택함.)
pd.merge(df1, df2, left_on="name", right_on="emp_name").drop("emp_name", axis=1)

   name  dept project
0   이순신  연구개발       A
1   이순신  연구개발       S
2   강감찬    영업       S
3  을지문덕  연구개발       D

In [156]:
#df1의 name과 df2의 emp_nmae이 동일한 값이므로 merge 사용 가능
#동일 데이터 중, df1를 윈쪽, df2를 오른쪽으로 위치해서 병합
#데이터가 겹치니 둘 중 하나를 체거 (여기선 df2의 emp_name열을 택함.)
#join안된 김유신을 누락하지 않게 해줌.
pd.merge(df1, df2, how="outer", left_on="name", right_on="emp_name").drop("emp_name", axis=1)

   name  dept project
0   이순신  연구개발       A
1   이순신  연구개발       S
2   강감찬    영업       S
3  을지문덕  연구개발       D
4   김유신    인사     NaN

# DataFrame객체의 정렬

### seaborn

matplotlib 기반의 시각화 라이브러리로 내장된 실습데이터를 불러올 수 있음.

head() : 데이터 앞부분 일부만 보여줌.

tail() : 데이터 뒷부분 일부만 보여줌.

sort_values(by=[열들],ascending=[]) : 정렬 (ascending=False -> 내림차순 / ascending=True -> 오름차순)

groupby(열1)[[열2]].aggregate(연산방법) : 열1을 기준으로 열2를 연산해 보여줌.

apply() : 결과값을 가공처리

In [2]:
#titanic실습데이터를 불러와 앞부분을 보여줌.
import seaborn as sns
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [3]:
#데이터 정렬 후, 앞부분 보여줌.
#fare는 내림차순, sex는 오름차순
titanic.sort_values(by=["fare", "sex"], ascending=[False, True]).head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
258,1,1,female,35.0,0,0,512.3292,C,First,woman,False,NaN,Cherbourg,yes,True
679,1,1,male,36.0,0,1,512.3292,C,First,man,True,B,Cherbourg,yes,False
737,1,1,male,35.0,0,0,512.3292,C,First,man,True,B,Cherbourg,yes,True
88,1,1,female,23.0,3,2,263.0000,S,First,woman,False,C,Southampton,yes,False
341,1,1,female,24.0,3,2,263.0000,S,First,woman,False,C,Southampton,yes,False

In [4]:
# sex와 survived를 그룹화해 survived의 평균값 연산
titanic.groupby("sex")[["survived"]].aggregate("mean")

        survived
sex
female  0.742038
male    0.188908

In [5]:
#sex별로 survived(값에서 평균값을 뺀 값)를 보여줌.
titanic.groupby("sex")[["survived"]].aggregate("mean").apply(lambda x: x - x.mean())

        survived
sex
female  0.276565
male   -0.276565

# DataFrame 피벗 테이블 생성
표의 데이터를 요약하는 통계표

In [10]:
#sex와 class를 survived 평균값들로 구성
#["sex", "class"] -> Series로 변형
titanic.groupby(["sex", "class"])["survived"].aggregate("mean")

sex     class
female  First     0.968085
        Second    0.921053
        Third     0.500000
male    First     0.368852
        Second    0.157407
        Third     0.135447
Name: survived, dtype: float64

In [12]:
#sex와 class를 survived 평균값들로 구성
#unstack을 사용해 Series를 DataFrame으로 다시 변형해 행이었던 class의 index를 열로 전환
#sex의 index들을 행으로, class의 index를 열로 하여 survived값들로 표현
titanic.groupby(["sex", "class"])["survived"].aggregate("mean").unstack()

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [15]:
#()안에는 하나의 열만 올 수 있어 sex와 class를 그냥 넣으면 에러가 뜸.
#[]를 사용하여 series로 바꿔줘야 함.
titanic.groupby("sex", "class")["survived"].aggregate("mean")

ValueError: No axis named class for object type DataFrame

In [7]:
#index를 sex로, 열을 class로 하여 survived값들로 테이블 구성
#pivot_table의 기본값은 평균값(mean)
#원하는 집계함수를 사용하고 싶을 때는 aggfunc = ['mean','max']이런 식으로 표현
titanic.pivot_table("survived", index="sex", columns="class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447